{"version": "https://jsonfeed.org/version/1", "title": "ILYA ZAKHARAU - About Product Management, Business Analysis, and APIs", "home_page_url": "https://ilyazakharau.com/", "feed_url": "https://ilyazakharau.com/feed_json_updated.json", "description": "'Hey, I am Ilya Zakharau, a skilled Product Manager with extensive experience in B2B Enterprise products focusing on API. \nI am passionate about building Platforms that allow other people to develop and deliver their products.\nAlso, I write and speak regularly about APIs, Product Management and Business Analysis topics on LinkedIn, Medium, and my blog (welcome, by the way).'\n", "icon": null, "authors": [], "language": "en", "items": [{"id": "https://ilyazakharau.com/product-management-in-practice/", "url": "https://ilyazakharau.com/product-management-in-practice/", "title": "Best Book I Read in My Career - \"Product Management in Practice\" by Matt LeMay", "content_html": " The \"Product Management in Practice\" by Matt LeMay is 100% in the top 5 product management books written so far. Must read, even if you are not a product manager but are interested in the topic. I suggest that brilliant book.", "image": null, "date_modified": "2024-06-17T18:17:38+00:00", "authors": [], "tags": null}, {"id": "https://ilyazakharau.com/barszawa-blog-edition-05-2024/", "url": "https://ilyazakharau.com/barszawa-blog-edition-05-2024/", "title": "BArszawa Blog #5 (May'24)", "content_html": "<h1>BArszawa Blog #5 (May'24) Edition is out!</h1>\n<p>Here is the next blog edition of our Business Analysis Community in Warsaw: [BArszawa Blog #5 (May'24)](https://...</p>", "image": null, "date_modified": "2024-06-02T09:17:39+00:00", "authors": [], "tags": null}, {"id": "https://ilyazakharau.com/product-manager-year-three/", "url": "https://ilyazakharau.com/product-manager-year-three/", "title": "Product Manager: Year Three", "content_html": "<h1>Product Manager: Year Three</h1>\n<p><img alt=\"\" src=\"images/product_management_3.jpg\">{ width=\"40%\"  align=left}</p>\n<p>I almost missed a point of reaching a three-year tier in my product manager career, which nearly matches with ten years in IT. I wrote essays about my previous years (<a href=\"https://ilyazakharau.com/product-manager-year-one/\">year one</a>, <a href=\"https://ilyazakharau.com/product-manager-sophomore-year/\">year two</a>, <a href=\"https://medium.com/p/5c204da38c34\">combined article on Medium</a>) as a retrospective of my thoughts and feelings.</p>\n<p>I had doubts about whether I wanted to write the continuation. I re-read previous pieces, which made me realize I needed to continue. First, the \"Sophomore Year\" was quite depressing. Second, I need to finish the series, and having that as a trilogy sounds right.</p>\n<p>I don't say it will be optimistic than a previous one. A bit brighter, maybe. And most probably, the last. Writing that in a third time felt more like an obligation.</p>\n<p>Anyway, it is time for a retrospective of my 3rd year of being in product management.</p>\n<h2>Platform engineering and product management</h2>\n<p>Last year, I had an identity crisis because my job seemed to be far away from what is written on product management. It coincides with general terms, but the devil is always in details.</p>\n<p>Then, I realized that platform engineering and product managers who are working on Internal Development Platforms (IDP). There is a community, books, webinars, courses, and tools around that. Many people are doing similar things I am trying to do and have similar problems.</p>", "image": null, "date_modified": "2024-05-27T22:05:28+00:00", "authors": [], "tags": null}, {"id": "https://ilyazakharau.com/writing-routine/", "url": "https://ilyazakharau.com/writing-routine/", "title": "About My Writing Routine", "content_html": "<h1>About My Writing Routine</h1>\n<p>Here is my writing routine: the way how I structure my research on various topics and then write an article.</p>\n<p>It is not my usual type of content, but it might be helpful to someone. And yes, I need to fill the vacuum while working on two new writing pieces: a book review and a new topic.</p>\n<h2>Writing Tools</h2>\n<p>I use <a href=\"https://obsidian.md/\">Obsidian</a> as a knowledge base and content management. It is free, keeps your data in your hands, not in a vendor cloud, uses Markdown for formatting, and has a variety of great plugins. </p>\n<p>The latter is handy as my blog is also built with the <a href=\"https://www.mkdocs.org/\">MkDocs</a> engine based on the Markdown format. So, I keep writing and editing in Markdown, which is very convenient. I don't particularly appreciate it when each tool tries to reinvent the wheel with its custom formatting, which is incompatible with anyone else. With Markdown files stored on my local machine and my cloud storage, I can quickly grab them and migrate them to another tool.</p>\n<p>I use the <a href=\"https://zettelkasten.de/overview/\">Zettelkasten</a> technique in Obsidian when I research something and need to document some information and my thoughts to reference it later. You can find a lot of information about this approach. I keep my notes connected with tags and internal references where possible. Obsidian provides a nice graph where I can filter out some notes and track references.</p>\n<p>Once a year, I clean up by editing, merging, or even deleting some notes. So, I try to keep the number of my Markdown notes from spreading. You can see a part of the notes graph in the attached image below.</p>\n<p><img alt=\"Graph view\" src=\"images/writing-routine/writing-routine-1.png\"></p>", "image": null, "date_modified": "2024-05-26T10:01:24+00:00", "authors": [], "tags": null}, {"id": "https://ilyazakharau.com/barszawa-blog-edition-03-2024/", "url": "https://ilyazakharau.com/barszawa-blog-edition-03-2024/", "title": "BArszawa Blog - March’24 Edition is out!", "content_html": "<h1>BArszawa Blog - March’24 Edition is out!</h1>\n<p>I am happy to introduce the third edition of the monthly BArszawa blog, to which I contribute as an author and ed...</p>", "image": null, "date_modified": "2024-05-01T07:21:07+00:00", "authors": [], "tags": null}, {"id": "https://ilyazakharau.com/barszawa-blog-edition-04-2024/", "url": "https://ilyazakharau.com/barszawa-blog-edition-04-2024/", "title": "BArszawa Blog - April’24 Edition is out!", "content_html": "<h1>BArszawa Blog - April’24 Edition is out!</h1>\n<p>A month has almost passed, so here is a new edition of the BArszawa blog, where I serve as a contributor and edit...</p>", "image": null, "date_modified": "2024-05-01T07:21:07+00:00", "authors": [], "tags": null}, {"id": "https://ilyazakharau.com/requirements-api-analysis/", "url": "https://ilyazakharau.com/requirements-api-analysis/", "title": "A new part of Requirements & API - Analysis is available!", "content_html": "<p>Last month, I started summarizing all my API-related posts, workshops, and webinars into extended and structured reading. That is usually a part of the Essay...</p>", "image": null, "date_modified": "2024-04-21T22:59:46+00:00", "authors": [], "tags": null}, {"id": "https://ilyazakharau.com/backlog-management-about-dependencies/", "url": "https://ilyazakharau.com/backlog-management-about-dependencies/", "title": "Backlog Management - About Dependencies", "content_html": "<h1>Backlog Management - About Dependencies</h1>\n<p>Recently, LinkedIn asked me to share my insights to be eligible for the \"Top Voice\" badge. I realized that I have something to share with my followers in a more extended way than typical (~~ChatGPT-generated~~) answers to those top-voice questions.</p>\n<h2>Definition and classification of dependencies</h2>\n<p>As usual, let's start with the definition, which is rather made on my own. ==When you need someone to do something so you can do your work, that is a dependency. Postponing the dependency means a delay in delivering your work and the expected outcome, which causes financial losses.==<img alt=\"Mixed pattern to resolve\" src=\"images/about_dependencies.jpg\">{ align=right width=50% }</p>\n<p>Your team/service can have one or several dependencies and be a dependency for someone else. Sometimes it can be both. And dependencies might be temporary when you need something to be done once or permanent when you continuously need something to operate.</p>\n<p>There can be external dependencies, meaning that you are waiting for something to be done outside your organization. Or that will be done inside your organization, which is an internal dependency.</p>\n<p>We can distinguish cross-team, cross-stream, and cross-department dependencies, each with its own peculiarities.</p>\n<p>In my world, dependency means an API or a software library. In your world, that may be anything else, like a vehicle part or a plumber to fix a pipeline leak.</p>", "image": null, "date_modified": "2024-04-08T21:48:06+00:00", "authors": [], "tags": null}, {"id": "https://ilyazakharau.com/firefighting-depencies-case-study/", "url": "https://ilyazakharau.com/firefighting-depencies-case-study/", "title": "Firefighting in the Dependency Hell: a Case Study", "content_html": "<h1>Firefighting in the Dependency Hell: a Case Study</h1>\n<h2>Disclaimer</h2>\n<p>The following case study focuses on dependency management, omitting other details that are irrelevant to the topic or might be sensitive to share publicly.</p>\n<p>I do not necessarily speak on my behalf. Let's assume some Product Owner (The PO) appeared in such a situation and acted a certain way to resolve the dependencies.</p>\n<h2>Background context</h2>\n<p>There are a few details to be mentioned to provide context:</p>\n<ul>\n<li>PO joined an ongoing project at its critical stage. Thus, there was no room for cross-organizational changes.</li>\n<li>PO had a flexible number of responsibilities, which might vary considerably from that of the vanilla Scrum product owner.</li>\n<li>PO had a great team; it would be impossible without them.</li>\n</ul>\n<h2>Dependencies structure</h2>\n<p>This is what the team topology looks like, approximately. And that impacted how dependencies are distributed.</p>\n<p><img alt=\"\" src=\"images/firefighting-dependencies-case-study/picture-1.png\"></p>\n<p>Three organizations are involved, each with their own development teams and management. It is obvious that each side pursues its own goals in accordance with contractual obligations.</p>", "image": null, "date_modified": "2024-04-07T12:38:48+00:00", "authors": [], "tags": null}, {"id": "https://ilyazakharau.com/api-requirements-webinar-iiba-part-1%262/", "url": "https://ilyazakharau.com/api-requirements-webinar-iiba-part-1%262/", "title": "Summary of the \"Requirements & API\" webinars for IIBA Belarus", "content_html": "On November 9, 2023, I hosted the second part of the \"Requirements & API\" for the IIBA Belarus Chapter. Let's summarize it...", "image": null, "date_modified": "2024-02-29T23:13:22+00:00", "authors": [], "tags": null}, {"id": "https://ilyazakharau.com/team-topologies/", "url": "https://ilyazakharau.com/team-topologies/", "title": "Thoughts about \"Team Topologies\" by Matthew Skelton and Manuel Pais", "content_html": "<h1>Thoughts about \"Team Topologies\" by Matthew Skelton and Manuel Pais</h1>\n<p>This time, let's talk about \"<a href=\"https://a.co/d/eu7mx3L\">Team Topologies: Organizing Business and Technology Teams for Fast Flow</a>,\" a book about organizational design written by Matthew Skelton and Manuel Pais.</p>\n<p><img alt=\"Book cover\" src=\"images/team_topologies_cover.jpg\">{ align=right }</p>\n<p><strong>Looking at the title, this book is not about product management or business analysis...</strong></p>\n<p>Yes, you are right. This book is about constructing teams and establishing their interactions. It is not about my day-to-day work, but it is an area of my concern. I tend to read general books about management more and more. So we will discuss more such books in the future.</p>\n<p><strong>How did you find out about \"Team Topologies\"?</strong></p>\n<p>I heard about it during the Platform Engineering fundamentals course brought by Tyk (I have a fancy certificate, by the way). There were a lot of references to that book, so I decided to add it to my reading list.\nIt is funny, but \"Team Topology\" references many other sources but combines them into a solid idea.</p>\n<p>The book basically addresses the most common problem, probably on the humanity level.</p>\n<p><strong>What kind of problem do you mean? We have plenty of those.</strong></p>\n<p>Communication. The lack of it, to be precise. </p>", "image": null, "date_modified": "2024-02-25T10:10:30+00:00", "authors": [], "tags": null}, {"id": "https://ilyazakharau.com/barszawa-blog-edition-02-2024/", "url": "https://ilyazakharau.com/barszawa-blog-edition-02-2024/", "title": "BArszawa Blog - February’24 Edition", "content_html": "<h1>BArszawa Blog - February’24 Edition</h1>\n<p>I am proud to present the second edition of the monthly newsletter made by BArszawa - the Business Analysis community in Warsaw. In one of the previous posts, I explained what this community is and my role in it.</p>\n<p>Here is a link to <a href=\"https://www.buymeacoffee.com/barszawaorg/yudoyeyefe?utm_source=izblog&amp;utm_medium=post\">BArszawa Blog - February’24 Edition</a></p>\n<p>I act as an editor, combining some materials gathered by the Community OrgTeam, writing a foreword, and publishing on different media platforms.</p>\n<p>Hoping you enjoy that post and find it helpful. Please feel free to share it with your friends and colleagues, support us, and visit us if you appear to be in Warsaw, Poland.</p>", "image": null, "date_modified": "2024-02-18T22:57:38+00:00", "authors": [], "tags": null}, {"id": "https://ilyazakharau.com/swebok-v3-v4/", "url": "https://ilyazakharau.com/swebok-v3-v4/", "title": "SWEBOK v3 and v4 - Software Requirements", "content_html": "<p><a href=\"https://www.computer.org/education/bodies-of-knowledge/software-engineering\">SWEBOK Guide</a>, by its nature, is similar to other Bodies of Knowledge (PMBOK, BABOK, etc.) and stands for the Guide to the Software Engineering Body of Knowledge. It is not a standard but a guide that defines the scope of software engineering as a discipline (that is important to address). It outlines Knowledge Areas described in terms of its component processes, practices, inputs, outputs, tools, and techniques. Those areas are representations of the discipline at a particular moment.</p>\n<p>Of course, Software engineering can't ignore such a massive topic as requirements. So it contains a dedicated chapter, or, in SWEBOK terms, knowledge area (KA)  \"Software Requirements\".</p>\n<p>I started learning about industry standards and Bodies of Knowledge a few years ago. So I went through SWEBOK Guide v3, published in 2014, to review existing KAs focusing on the \"Software Requirements.\"</p>\n<p>The <a href=\"https://waseda.app.box.com/v/SWEBOK4-book\">4th version</a> is in the public review and will replace v3 soon. This article compares the Software Requirements chapter, my domain of interest, between newer and current versions. And there is what to compare. But let's go back to v3.</p>\n<p>And there is not much there. The KA heavily relies on an older edition (2nd) of the \"Software Requirements\" by Karl Wiegers and just a few other well-known sources. And the chapter itself is about 18 pages long. The Guide should not provide extensive information about a particular topic but should give an overview and further references to study.</p>\n<p>However, the provided information is insufficient to give an overview of such an essential piece of software engineering. Moreover, it struggles to offer a structured categorization of requirements types and a comprehensive overview of requirements practices.</p>\n<p>^^I am not criticizing; I am expressing my feeling that not enough attention was given to that part of SWEBOK.^^ And written in 2014, it quickly became outdated.</p>\n<p>I read it for the first time in 2020, and RUP (Rational Unified Process) has already been dead for a while. I barely heard about practicing RUP in 2014 because Agile methodologies were on the hype train then (and claimed to be dead soon, too). A newer generation of IT folks has no idea what it is.</p>\n<p>I could not recommend SWEBOK Guide v3 to start your journey to the requirements engineer or business analysis. Even at the moment of 2014, there were better sources and materials. This KA looks unarticulated compared to the further KAs.</p>\n<p>{==The good news is that v4 has done everything right!==}</p>\n<p>In 2024, I started revisiting the standards BOKs, researching some topics for future articles. For the sake of curiosity, I have looked into a draft version of SWEBOK Guide v4 (<em>2024 Jan 16th Public Review Version</em>). And I am surprised in a good way. The \"Software Requirements\" KA has been completely rewritten and extended. </p>\n<p>I am not going to dive deep into reviewing each point. You can easily read the document and make your conclusion. And we need to consider that it is still not a final version, and some changes are expected. However, I don't expect much will change: IEEE (Institute of Electrical and Electronics Engineers) folks and KA editors have done a great job.</p>\n<p>{++Let's see what v4 has done right compared to v3:++} </p>", "image": null, "date_modified": "2024-02-13T06:40:46+00:00", "authors": [], "tags": null}, {"id": "https://ilyazakharau.com/replacing-legacy-blog-edition/", "url": "https://ilyazakharau.com/replacing-legacy-blog-edition/", "title": "Entire \"Replacing Legacy\" series is available on the Blog", "content_html": "<h1>Entire \"Replacing Legacy\" series is available on the Blog</h1>\n<p>For those who are not Medium fans, I've packed the <a href=\"https://ilyazakharau.com/essays/replacing-legacy/\">Replacing Legacy series</a> into the long read available on my blog.</p>\n<p>There are some slight differences from the original: some passages have been edited, and others have been removed. Text is now more straightforward, but there are still a lot of places for improvement.</p>\n<p>Now everything is in one place. I hope you enjoy reading.</p>\n<p><strong>And a few more updates:</strong></p>\n<p>-&gt; I keep experimenting with formats and media platforms. Now, I will no longer publish unique content on one platform, like I did with the above-mentioned series on Medium.</p>\n<p>I will simultaneously post on <a href=\"https://medium.com/@ilyazakharau\">Medium</a> and my blog. On <a href=\"https://www.linkedin.com/in/ilya-zakharau/\">LinkedIn</a>, I publish a link to the blog with a short summary. So there will be a choice of where to read. And I will not spend time again migrating content from one place to another.</p>\n<p>I am unsure about maintaining LinkedIn Articles, as last year's experience was not the best. The traction was minimal compared to a usual post.</p>", "image": null, "date_modified": "2024-02-07T23:11:35+00:00", "authors": [], "tags": null}, {"id": "https://ilyazakharau.com/definition-of-api-requirements/", "url": "https://ilyazakharau.com/definition-of-api-requirements/", "title": "Definition of API requirements", "content_html": "<p>*There is a <a href=\"/definition-of-api-requirements-v2\">2nd revision of this article</a>, so please read it instead. This, as my first published post in this blog, wil...</p>", "image": null, "date_modified": "2024-02-04T10:27:20+00:00", "authors": [], "tags": null}, {"id": "https://ilyazakharau.com/api-design-first/", "url": "https://ilyazakharau.com/api-design-first/", "title": "API Design-First", "content_html": "This article is a part of the API Design series, where I will uncover API design concepts for my non-technical peers. You don't need to be a developer or an architect to participate to design or even build an API, but there is something you should learn to succeed.", "image": null, "date_modified": "2024-02-04T10:27:20+00:00", "authors": [], "tags": null}, {"id": "https://ilyazakharau.com/api-design-tooling/", "url": "https://ilyazakharau.com/api-design-tooling/", "title": "API Design Tooling", "content_html": "This article is a part of the API Design series, where I will review several API design tools and summarize my experiences.", "image": null, "date_modified": "2024-02-04T10:27:20+00:00", "authors": [], "tags": null}, {"id": "https://ilyazakharau.com/performance-metrics-obsession/", "url": "https://ilyazakharau.com/performance-metrics-obsession/", "title": "How I overcame my obsession with performance metrics", "content_html": "This is the story of how I became obsessed with numbers instead of being obsessed with a product. And how I overcame that and shifted my focus to real value.", "image": null, "date_modified": "2024-02-04T10:27:20+00:00", "authors": [], "tags": null}, {"id": "https://ilyazakharau.com/product-manager-year-one/", "url": "https://ilyazakharau.com/product-manager-year-one/", "title": "Product Manager: Year One", "content_html": "In this essay, I want to summarize my experience with the insights I collected throughout the year. Some of them might be obvious to a more experienced audience. But for me, some of them were kind of revelations, and some of them were hugely underestimated initially.", "image": null, "date_modified": "2024-02-04T10:27:20+00:00", "authors": [], "tags": null}, {"id": "https://ilyazakharau.com/reading-gharajedaghi-system-thinking/", "url": "https://ilyazakharau.com/reading-gharajedaghi-system-thinking/", "title": "Thoughts about J. Gharajedaghi’s \"System Thinking\"", "content_html": "This piece was not originally planned to be published. I just feel a need to share something with the world after I read a book in the title. Because that was a wonderful but pretty tough experience.", "image": null, "date_modified": "2024-02-04T10:27:20+00:00", "authors": [], "tags": null}]}